"""
3. Реализовать базовый класс Worker (работник), в котором определить атрибуты:
name, surname, position (должность), income (доход).
Последний атрибут должен быть защищенным и ссылаться на словарь,
содержащий элементы: оклад и премия, например,
{"wage": wage, "bonus": bonus}. Создать класс Position (должность) на базе класса Worker.
В классе Position реализовать методы получения полного имени
сотрудника (get_full_name) и дохода с учетом премии (get_total_income).
Проверить работу примера на реальных данных
(создать экземпляры класса Position, передать данные, проверить значения атрибутов, вызвать методы экземпляров).
"""


class Worker:
    def __init__(self):
        self.name = ''
        self.surname = ''
        self.position = ''
        self._income = {'wage': 2000, 'bonus': 1000}


class Position(Worker):
    def __init__(self):
        super().__init__()

    def get_full_name(self):
        return f'{self.name} {self.surname}'

    def get_total_income(self):
        return self._income['wage'] + self._income['bonus']


pos = Position()
pos.name = 'Tony'
pos.surname = 'Hat'
pos.position = 'manager'
print(pos.get_full_name())
print(pos.get_total_income())
